{
  "backend/main.mo": "Motoko canister implementing user profiles and encrypted case management with access‑controlled CRUD operations and status/hearing updates.",
  "feature_evidence.json": "Feature evidence report describing authentication bug investigations, file scopes, components, and test IDs for three high-confidence tasks.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend modules including pages, components, hooks, crypto utilities, and case-management logic.",
  "frontend/.env.production.example": "Example production env file showing how to configure a custom or default Internet Identity URL.",
  "frontend/DEPLOYMENT_MAINNET.md": "Mainnet deployment guide explaining prerequisites and how to configure Internet Identity for production builds.",
  "frontend/index.css": "Tailwind CSS base/theme definitions with light/dark mode variables and global styling.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack router routes, React Query client, Internet Identity provider, theming, and global layout with RequireAuth.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using useAuthUi with diagnostic logging and state‑aware labeling.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard handling redirects, intended-route restoration, loop prevention, and UI states for login/init errors.",
  "frontend/src/components/cases/CaseForm.tsx": "Form component for creating or editing a case, handling core fields plus nested hearings and evidence editors. Manages form state, submission, and field updates.",
  "frontend/src/components/cases/EvidenceEditor.tsx": "Manages a dynamic list of evidence entries with add, edit, and remove functionality. Renders textarea inputs inside cards.",
  "frontend/src/components/cases/HearingsEditor.tsx": "Provides UI to add, edit, and remove hearings, including date, status, outcome, and notes. Updates parent state with structured hearing objects.",
  "frontend/src/components/cases/StatusBadge.tsx": "Displays a styled badge for a case status using label and color helpers. Accepts optional class overrides.",
  "frontend/src/components/dashboard/CasesTable.tsx": "Sortable table displaying case records with status badges and navigation to case details. Supports sorting by multiple fields and configurable date column.",
  "frontend/src/components/dashboard/DashboardFilters.tsx": "Filter controls for searching cases, filtering by status, and choosing the date column. Updates parent state through provided callbacks.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Application-wide error boundary that catches runtime errors and shows a recovery UI. Provides a session-clearing recovery action and logs diagnostic info.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component rendering header, navigation, footer, auth checks, and profile dialog. Handles navigation and displays routes conditionally based on authentication.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting authenticated users to set a display name stored in localStorage. Opens only when a name is missing and saves it on submit.",
  "frontend/src/components/security/UnlockVaultDialog.tsx": "Dialog for initializing or unlocking the encrypted vault using a passphrase. Handles validation, error display, and interaction with the encryption hook.",
  "frontend/src/crypto/keyStore.ts": "Local key store managing vault initialization, key derivation, unlocking, and storage of salt per principal. Provides access to the derived CryptoKey and lock state.",
  "frontend/src/crypto/webCrypto.ts": "Utility functions for deriving keys, encrypting, decrypting, and handling salts using WebCrypto APIs. Implements AES-GCM encryption and PBKDF2 key derivation.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to the authenticated identity. Recreates actors on identity change and invalidates dependent queries.",
  "frontend/src/hooks/useAuthUi.ts": "UI-oriented auth hook with normalized error handling, status derivation, login safeguards, and logout/reset helpers. Wraps useInternetIdentity with additional UI logic.",
  "frontend/src/hooks/useEncryption.ts": "Hook managing vault encryption state using keyStore, including initialization, unlocking, locking, and encrypt/decrypt helpers. Syncs state with the authenticated principal.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating case data via an actor, with success/error toasts and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and print media overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CaseDetailPage.tsx": "Displays a single case by fetching, decrypting, and presenting details with options to edit or delete.",
  "frontend/src/pages/CaseEditPage.tsx": "Handles creating or editing a case, including decryption, form display, and saving encrypted updates.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a dashboard of decrypted cases with filtering, printing, PDF export, and vault unlocking when encryption is locked.",
  "frontend/src/pages/IntegrationsPage.tsx": "React page for configuring integration API settings, saving them to localStorage, and triggering a mock sync with status tracking.",
  "frontend/src/processEnvShim.ts": "Shim that populates process.env from Vite env variables and validates II_URL for Internet Identity compatibility.",
  "frontend/src/services/cases/caseCodec.ts": "Provides functions to encrypt and decrypt case data fields using supplied crypto functions.",
  "frontend/src/services/status/statusRules.ts": "Computes automatic case status and provides helpers for status labels and color classes.",
  "frontend/src/utils/authClientStorage.ts": "Clears localStorage and IndexedDB entries related to Internet Identity and AuthClient sessions.",
  "frontend/src/utils/authDiagnostics.ts": "Optional debug logger for authentication and navigation events with sensitive-data sanitization.",
  "frontend/src/utils/exportPdf.ts": "Generates a CSV export of cases with selected date fields and triggers a file download.",
  "frontend/src/utils/intendedRoute.ts": "Stores, retrieves, and clears intended post-login routes in sessionStorage with normalization.",
  "frontend/src/utils/normalizeAuthError.ts": "Converts unknown authentication errors into safe, user-friendly strings with extensive fallbacks.",
  "frontend/src/utils/printReport.ts": "Generates a printable HTML report for case data in a new window, formatting dates and statuses into a styled table.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Stores project metadata, known issues, and feature requests, including an auth-related infinite render loop bug."
}